Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MX_DFP/1.5.259/atdf/PIC32MX340F128L.atdf
         <register caption="" name="ADC1BUF4" offset="0xb0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF4" />
         </register>
         <register caption="" name="ADC1BUF5" offset="0xc0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF5" />
         </register>
         <register caption="" name="ADC1BUF6" offset="0xd0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF6" />
         </register>
         <register caption="" name="ADC1BUF7" offset="0xe0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF7" />
         </register>
         <register caption="" name="ADC1BUF8" offset="0xf0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF8" />
         </register>
         <register caption="" name="ADC1BUF9" offset="0x100" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF9" />
         </register>
         <register caption="" name="ADC1BUFA" offset="0x110" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUFA" />
         </register>
         <register caption="" name="ADC1BUFB" offset="0x120" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUFB" />
         </register>
         <register caption="" name="ADC1BUFC" offset="0x130" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUFC" />
         </register>
         <register caption="" name="ADC1BUFD" offset="0x140" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUFD" />
         </register>
         <register caption="" name="ADC1BUFE" offset="0x150" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUFE" />
         </register>
         <register caption="" name="ADC1BUFF" offset="0x160" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUFF" />
         </register>
      </register-group>
      <value-group caption="Analog-to-Digital Conversion Status bit" name="AD1CON1__DONE">
         <value caption="Analog-to-digital conversion is done" name="" value="0x1" />
         <value caption="Analog-to-digital conversion is not done or has not started" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Sample Enable bit" name="AD1CON1__SAMP">
         <value caption="The ADC sample and hold amplifier is sampling" name="" value="0x1" />
         <value caption="The ADC sample/hold amplifier is holding" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Sample Auto-Start bit" name="AD1CON1__ASAM">
         <value caption="Sampling begins immediately after last conversion completes; SAMP bit is automatically set." name="" value="0x1" />
         <value caption="Sampling begins when SAMP bit is set" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop Conversion Sequence bit (when the first ADC interrupt is generated)" name="AD1CON1__CLRASAM">
         <value caption="Stop conversions when the first ADC interrupt is generated. Hardware clears the ASAM bit when the ADC interrupt is generated." name="" value="0x1" />
         <value caption="Normal operation, buffer contents will be overwritten by the next conversion sequence" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Trigger Source Select bits" name="AD1CON1__SSRC">
         <value caption="Internal counter ends sampling and starts conversion (auto convert)" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Timer 3 period match ends sampling and starts conversion" name="" value="0x2" />
         <value caption="Active transition on INT0 pin ends sampling and starts conversion" name="" value="0x1" />
         <value caption="Clearing SAMP bit ends sampling and starts conversion" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Output Format bits" name="AD1CON1__FORM">
         <value caption="Signed Fractional 16-bit" name="" value="0x3" />
         <value caption="Fractional 16-bit" name="" value="0x2" />
         <value caption="Signed Integer 16-bit" name="" value="0x1" />
         <value caption="Integer 16-bit" name="" value="0x0" />
         <value caption="Signed Fractional 32-bit" name="" value="0x7" />
         <value caption="Fractional 32-bit" name="" value="0x6" />
         <value caption="Signed Integer 32-bit" name="" value="0x5" />
         <value caption="Integer 32-bit" name="" value="0x4" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="AD1CON1__SIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Operating Mode bit" name="AD1CON1__ON">
         <value caption="ADC module is operating" name="" value="0x1" />
         <value caption="ADC module is not operating" name="" value="0x0" />
      </value-group>
      <value-group caption="Alternate Input Sample Mode Select bit" name="AD1CON2__ALTS">
         <value caption="Uses Sample A input multiplexer settings for first sample then alternates between Sample B and Sample A input multiplexer settings for all subsequent samples" name="" value="0x1" />
         <value caption="Always use Sample A input multiplexer settings" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Result Buffer Mode Select bit" name="AD1CON2__BUFM">
         <value caption="Buffer configured as two 8-word buffers ADC1BUF7-ADC1BUF0 / ADC1BUFF-ADCBUF8" name="" value="0x1" />
         <value caption="Buffer configured as one 16-word buffer ADC1BUFF-ADC1BUF0" name="" value="0x0" />
      </value-group>
      <value-group caption="Sample/Convert Sequences Per Interrupt Selection bits" name="AD1CON2__SMPI">
         <value caption="Interrupts at the completion of conversion for each 16th sample/convert sequence" name="" value="0xf" />
         <value caption="Interrupts at the completion of conversion for each 15th sample/convert sequence" name="" value="0xe" />
         <value caption="Interrupts at the completion of conversion for each 14th sample/convert sequence" name="" value="0xd" />
         <value caption="Interrupts at the completion of conversion for each 13th sample/convert sequence" name="" value="0xc" />
         <value caption="Interrupts at the completion of conversion for each 12th sample/convert sequence" name="" value="0xb" />
         <value caption="Interrupts at the completion of conversion for each 11th sample/convert sequence" name="" value="0xa" />
         <value caption="Interrupts at the completion of conversion for each 10th sample/convert sequence" name="" value="0x9" />
         <value caption="Interrupts at the completion of conversion for each 9th sample/convert sequence" name="" value="0x8" />
         <value caption="Interrupts at the completion of conversion for each 8th sample/convert sequence" name="" value="0x7" />
         <value caption="Interrupts at the completion of conversion for each 7th sample/convert sequence" name="" value="0x6" />
         <value caption="Interrupts at the completion of conversion for each 6th sample/convert sequence" name="" value="0x5" />
         <value caption="Interrupts at the completion of conversion for each 5th sample/convert sequence" name="" value="0x4" />
         <value caption="Interrupts at the completion of conversion for each 4th sample/convert sequence" name="" value="0x3" />
         <value caption="Interrupts at the completion of conversion for each 3rd sample/convert sequence" name="" value="0x2" />
         <value caption="Interrupts at the completion of conversion for each 2nd sample/convert sequence" name="" value="0x1" />
         <value caption="Interrupts at the completion of conversion for each sample/convert sequence" name="" value="0x0" />
      </value-group>
