Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MX_DFP/1.5.259/atdf/PIC32MX340F128L.atdf
         <register caption="" name="LATG" offset="0x1a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATG" />
            <bitfield mask="0x00000002" name="LATG" />
            <bitfield mask="0x00000004" name="LATG" />
            <bitfield mask="0x00000008" name="LATG" />
            <bitfield mask="0x00000010" name="LATG" />
            <bitfield mask="0x00000020" name="LATG" />
            <bitfield mask="0x00000040" name="LATG" />
            <bitfield mask="0x00000080" name="LATG" />
            <bitfield mask="0x00000100" name="LATG" />
            <bitfield mask="0x00000200" name="LATG" />
            <bitfield mask="0x00000400" name="LATG" />
            <bitfield mask="0x00000800" name="LATG" />
            <bitfield mask="0x00001000" name="LATG" />
            <bitfield mask="0x00002000" name="LATG" />
            <bitfield mask="0x00004000" name="LATG" />
            <bitfield mask="0x00008000" name="LATG" />
         </register>
         <register caption="" name="ODCA" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCA" />
            <bitfield mask="0x00000002" name="ODCA" />
            <bitfield mask="0x00000004" name="ODCA" />
            <bitfield mask="0x00000008" name="ODCA" />
            <bitfield mask="0x00000010" name="ODCA" />
            <bitfield mask="0x00000020" name="ODCA" />
            <bitfield mask="0x00000040" name="ODCA" />
            <bitfield mask="0x00000080" name="ODCA" />
            <bitfield mask="0x00000100" name="ODCA" />
            <bitfield mask="0x00000200" name="ODCA" />
            <bitfield mask="0x00000400" name="ODCA" />
            <bitfield mask="0x00000800" name="ODCA" />
            <bitfield mask="0x00001000" name="ODCA" />
            <bitfield mask="0x00002000" name="ODCA" />
            <bitfield mask="0x00004000" name="ODCA" />
            <bitfield mask="0x00008000" name="ODCA" />
         </register>
         <register caption="" name="ODCB" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCB" />
            <bitfield mask="0x00000002" name="ODCB" />
            <bitfield mask="0x00000004" name="ODCB" />
            <bitfield mask="0x00000008" name="ODCB" />
            <bitfield mask="0x00000010" name="ODCB" />
            <bitfield mask="0x00000020" name="ODCB" />
            <bitfield mask="0x00000040" name="ODCB" />
            <bitfield mask="0x00000080" name="ODCB" />
            <bitfield mask="0x00000100" name="ODCB" />
            <bitfield mask="0x00000200" name="ODCB" />
            <bitfield mask="0x00000400" name="ODCB" />
            <bitfield mask="0x00000800" name="ODCB" />
            <bitfield mask="0x00001000" name="ODCB" />
            <bitfield mask="0x00002000" name="ODCB" />
            <bitfield mask="0x00004000" name="ODCB" />
            <bitfield mask="0x00008000" name="ODCB" />
         </register>
         <register caption="" name="ODCC" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCC" />
            <bitfield mask="0x00000002" name="ODCC" />
            <bitfield mask="0x00000004" name="ODCC" />
            <bitfield mask="0x00000008" name="ODCC" />
            <bitfield mask="0x00000010" name="ODCC" />
            <bitfield mask="0x00000020" name="ODCC" />
            <bitfield mask="0x00000040" name="ODCC" />
            <bitfield mask="0x00000080" name="ODCC" />
            <bitfield mask="0x00000100" name="ODCC" />
            <bitfield mask="0x00000200" name="ODCC" />
            <bitfield mask="0x00000400" name="ODCC" />
            <bitfield mask="0x00000800" name="ODCC" />
            <bitfield mask="0x00001000" name="ODCC" />
            <bitfield mask="0x00002000" name="ODCC" />
            <bitfield mask="0x00004000" name="ODCC" />
            <bitfield mask="0x00008000" name="ODCC" />
         </register>
         <register caption="" name="ODCD" offset="0xf0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCD" />
            <bitfield mask="0x00000002" name="ODCD" />
            <bitfield mask="0x00000004" name="ODCD" />
            <bitfield mask="0x00000008" name="ODCD" />
            <bitfield mask="0x00000010" name="ODCD" />
            <bitfield mask="0x00000020" name="ODCD" />
            <bitfield mask="0x00000040" name="ODCD" />
            <bitfield mask="0x00000080" name="ODCD" />
            <bitfield mask="0x00000100" name="ODCD" />
            <bitfield mask="0x00000200" name="ODCD" />
            <bitfield mask="0x00000400" name="ODCD" />
            <bitfield mask="0x00000800" name="ODCD" />
            <bitfield mask="0x00001000" name="ODCD" />
            <bitfield mask="0x00002000" name="ODCD" />
            <bitfield mask="0x00004000" name="ODCD" />
            <bitfield mask="0x00008000" name="ODCD" />
         </register>
         <register caption="" name="ODCE" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCE" />
            <bitfield mask="0x00000002" name="ODCE" />
            <bitfield mask="0x00000004" name="ODCE" />
            <bitfield mask="0x00000008" name="ODCE" />
            <bitfield mask="0x00000010" name="ODCE" />
            <bitfield mask="0x00000020" name="ODCE" />
            <bitfield mask="0x00000040" name="ODCE" />
            <bitfield mask="0x00000080" name="ODCE" />
            <bitfield mask="0x00000100" name="ODCE" />
            <bitfield mask="0x00000200" name="ODCE" />
            <bitfield mask="0x00000400" name="ODCE" />
            <bitfield mask="0x00000800" name="ODCE" />
            <bitfield mask="0x00001000" name="ODCE" />
            <bitfield mask="0x00002000" name="ODCE" />
            <bitfield mask="0x00004000" name="ODCE" />
            <bitfield mask="0x00008000" name="ODCE" />
         </register>
         <register caption="" name="ODCF" offset="0x170" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCF" />
            <bitfield mask="0x00000002" name="ODCF" />
            <bitfield mask="0x00000004" name="ODCF" />
            <bitfield mask="0x00000008" name="ODCF" />
            <bitfield mask="0x00000010" name="ODCF" />
            <bitfield mask="0x00000020" name="ODCF" />
            <bitfield mask="0x00000040" name="ODCF" />
            <bitfield mask="0x00000080" name="ODCF" />
            <bitfield mask="0x00000100" name="ODCF" />
            <bitfield mask="0x00000200" name="ODCF" />
            <bitfield mask="0x00000400" name="ODCF" />
            <bitfield mask="0x00000800" name="ODCF" />
            <bitfield mask="0x00001000" name="ODCF" />
            <bitfield mask="0x00002000" name="ODCF" />
            <bitfield mask="0x00004000" name="ODCF" />
            <bitfield mask="0x00008000" name="ODCF" />
         </register>
         <register caption="" name="ODCG" offset="0x1b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCG" />
            <bitfield mask="0x00000002" name="ODCG" />
            <bitfield mask="0x00000004" name="ODCG" />
            <bitfield mask="0x00000008" name="ODCG" />
            <bitfield mask="0x00000010" name="ODCG" />
            <bitfield mask="0x00000020" name="ODCG" />
            <bitfield mask="0x00000040" name="ODCG" />
            <bitfield mask="0x00000080" name="ODCG" />
            <bitfield mask="0x00000100" name="ODCG" />
            <bitfield mask="0x00000200" name="ODCG" />
            <bitfield mask="0x00000400" name="ODCG" />
            <bitfield mask="0x00000800" name="ODCG" />
            <bitfield mask="0x00001000" name="ODCG" />
            <bitfield mask="0x00002000" name="ODCG" />
            <bitfield mask="0x00004000" name="ODCG" />
            <bitfield mask="0x00008000" name="ODCG" />
         </register>
         <register caption="" name="CNCON" offset="0x1c0" rw="RW" size="4">
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNEN" offset="0x1d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNEN0" />
            <bitfield mask="0x00000002" name="CNEN1" />
            <bitfield mask="0x00000004" name="CNEN2" />
            <bitfield mask="0x00000008" name="CNEN3" />
            <bitfield mask="0x00000010" name="CNEN4" />
            <bitfield mask="0x00000020" name="CNEN5" />
            <bitfield mask="0x00000040" name="CNEN6" />
            <bitfield mask="0x00000080" name="CNEN7" />
            <bitfield mask="0x00000100" name="CNEN8" />
            <bitfield mask="0x00000200" name="CNEN9" />
            <bitfield mask="0x00000400" name="CNEN10" />
            <bitfield mask="0x00000800" name="CNEN11" />
            <bitfield mask="0x00001000" name="CNEN12" />
            <bitfield mask="0x00002000" name="CNEN13" />
            <bitfield mask="0x00004000" name="CNEN14" />
            <bitfield mask="0x00008000" name="CNEN15" />
            <bitfield mask="0x00010000" name="CNEN16" />
            <bitfield mask="0x00020000" name="CNEN17" />
            <bitfield mask="0x00040000" name="CNEN18" />
            <bitfield mask="0x00080000" name="CNEN19" />
            <bitfield mask="0x00100000" name="CNEN20" />
            <bitfield mask="0x00200000" name="CNEN21" />
         </register>
         <register caption="" name="CNPUE" offset="0x1e0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUE0" />
            <bitfield mask="0x00000002" name="CNPUE1" />
            <bitfield mask="0x00000004" name="CNPUE2" />
            <bitfield mask="0x00000008" name="CNPUE3" />
            <bitfield mask="0x00000010" name="CNPUE4" />
            <bitfield mask="0x00000020" name="CNPUE5" />
            <bitfield mask="0x00000040" name="CNPUE6" />
            <bitfield mask="0x00000080" name="CNPUE7" />
            <bitfield mask="0x00000100" name="CNPUE8" />
            <bitfield mask="0x00000200" name="CNPUE9" />
            <bitfield mask="0x00000400" name="CNPUE10" />
            <bitfield mask="0x00000800" name="CNPUE11" />
            <bitfield mask="0x00001000" name="CNPUE12" />
            <bitfield mask="0x00002000" name="CNPUE13" />
            <bitfield mask="0x00004000" name="CNPUE14" />
            <bitfield mask="0x00008000" name="CNPUE15" />
            <bitfield mask="0x00010000" name="CNPUE16" />
            <bitfield mask="0x00020000" name="CNPUE17" />
            <bitfield mask="0x00040000" name="CNPUE18" />
            <bitfield mask="0x00080000" name="CNPUE19" />
            <bitfield mask="0x00100000" name="CNPUE20" />
            <bitfield mask="0x00200000" name="CNPUE21" />
         </register>
      </register-group>
   </module>
   <module caption="" id="01342" name="RCON" version="3">
      <register-group name="RCON">
         <register caption="Reset Control Register" name="RCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Power-on Reset Flag bit" mask="0x00000001" name="POR" values="RCON__POR" />
            <bitfield caption="Brown-out Reset Flag bit" mask="0x00000002" name="BOR" values="RCON__BOR" />
            <bitfield caption="Wake From Idle Flag bit" mask="0x00000004" name="IDLE" values="RCON__IDLE" />
            <bitfield caption="Wake From Sleep Flag bit" mask="0x00000008" name="SLEEP" values="RCON__SLEEP" />
            <bitfield caption="Watchdog Timer Time-out Flag bit" mask="0x00000010" name="WDTO" values="RCON__WDTO" />
            <bitfield caption="Software Reset Flag bit" mask="0x00000040" name="SWR" values="RCON__SWR" />
            <bitfield caption="External Reset (MCLR) Pin Flag bit" mask="0x00000080" name="EXTR" values="RCON__EXTR" />
            <bitfield caption="Voltage Regulator Standby Enable bit" mask="0x00000100" name="VREGS" values="RCON__VREGS" />
            <bitfield caption="Configuration Mismatch Reset Flag bit" mask="0x00000200" name="CMR" values="RCON__CMR" />
         </register>
         <register caption="Software Reset Register" name="RSWRST" offset="0x10" rw="RW" size="4">
            <bitfield caption="Software Reset Trigger bit" mask="0x00000001" name="SWRST" values="RSWRST__SWRST" />
         </register>
      </register-group>
